#ifndef __LCD1602_H_
#define __LCD1602_H_

#include "8052.h"
#include "kingst.h"

/*******************************************************************************
 * 函数名称 : LcdWaitReady
 * 函数介绍 : 等待Lcd为空闲状态
 * 参数介绍 : 无
 * 返回值   : 无
 ******************************************************************************/
extern void LcdWaitReady();

/*******************************************************************************
 * 函数名称 : LcdWriteCmd
 * 函数介绍 : 向Lcd发送命令
 * 参数介绍 : cmd : 将要发送的命令
 * 返回值   : 无
 ******************************************************************************/
extern void LcdWriteCmd(unsigned char cmd);

/*******************************************************************************
 * 函数名称 : LcdWriteData
 * 函数介绍 : 向Lcd发送数据
 * 参数介绍 : data : 将要发送的数据
 * 返回值   : 无
 ******************************************************************************/
extern void LcdWriteData(unsigned char data);

/*******************************************************************************
 * 函数名称 : LcdSetCursor
 * 函数介绍 : 设置光标位置
 * 参数介绍 : x : 将要设置光标的x轴
 *          y : 将要设置光标的y轴
 * 返回值   : 无
 ******************************************************************************/
extern void LcdSetCursor(unsigned char x, unsigned char y);

/*******************************************************************************
 * 函数名称 : initLcd
 * 函数介绍 : 初始化Lcd
 * 参数介绍 : 无
 * 返回值   : 无
 ******************************************************************************/
extern void initLcd();

/*******************************************************************************
 * 函数名称 : LcdFullClear
 * 函数介绍 : 清空Lcd显示屏
 * 参数介绍 : 无
 * 返回值   : 无
 ******************************************************************************/
extern void LcdFullClear();

/*******************************************************************************
 * 函数名称 : LcdAreaClear
 * 函数介绍 : 清空制定区域的显示屏
 * 参数介绍 : 无
 * 返回值   : 无
 ******************************************************************************/
extern void LcdAreaClear(unsigned char x, unsigned char y, unsigned char len);

/*******************************************************************************
 * 函数名称 : LcdShowString
 * 函数介绍 : 显示字符串
 * 参数介绍 : x,y: 字符串显示的位置
 * 			str : 将要显示的字符串
 * 返回值   : 无
 ******************************************************************************/
extern void LcdShowString(unsigned char x, unsigned char y,unsigned char *str);
#endif  //__LCD1602_H_
