#include "LCD1602.h"

/*******************************************************************************
 * 函数名称 : LcdWaitReady
 * 函数介绍 : 等待Lcd为空闲状态
 * 参数介绍 : 无
 * 返回值   : 无
 ******************************************************************************/
void LcdWaitReady()
{
	unsigned char status;
	LCD1602_DB = 0xFF;
	LCD1602_RS = 0;   //状态
	LCD1602_RW = 1;   //读
	
	do{
		LCD1602_E = 1;
		status = LCD1602_DB;  //读取状态位
		LCD1602_E = 0;
	}while(status & 0x80);
}

/*******************************************************************************
 * 函数名称 : LcdWriteCmd
 * 函数介绍 : 向Lcd发送命令
 * 参数介绍 : cmd : 将要发送的命令
 * 返回值   : 无
 ******************************************************************************/
void LcdWriteCmd(unsigned char cmd)
{
	EA = 0;
	ENLED = 1;  //禁止U3/U4,防止引脚对别的器件的影响
	LcdWaitReady();
	LCD1602_RS = 0;   //命令
	LCD1602_RW = 0;   //写
	LCD1602_DB = cmd;
	LCD1602_E = 1;    //脉冲
	LCD1602_E = 0;
	EA = 1;
}

/*******************************************************************************
 * 函数名称 : LcdWriteData
 * 函数介绍 : 向Lcd发送数据
 * 参数介绍 : data : 将要发送的数据
 * 返回值   : 无
 ******************************************************************************/
void LcdWriteData(unsigned char data)
{
	EA = 0;
	ENLED = 1;  //禁止U3/U4,防止引脚对别的器件的影响
	LcdWaitReady();
	LCD1602_RS = 1;   //数据
	LCD1602_RW = 0;   //写
	LCD1602_DB = data;
	LCD1602_E = 1;    //脉冲
	LCD1602_E = 0;
	EA = 1;
}

/*******************************************************************************
 * 函数名称 : LcdSetCursor
 * 函数介绍 : 设置光标位置
 * 参数介绍 : x : 将要设置光标的x轴
 *          y : 将要设置光标的y轴
 * 返回值   : 无
 ******************************************************************************/
void LcdSetCursor(unsigned char x, unsigned char y)
{
	unsigned char addr;
	if( y == 0)  //根据输入计算地址
	{
		addr = 0+x; //第一行地址从0x00开始
	}
	else
	{
		addr = 0x40 + x;  //第二行地址从0x40开始
	}
	LcdWriteCmd(addr | 0x80); //设置RAM地址
}

/*******************************************************************************
 * 函数名称 : initLcd
 * 函数介绍 : 初始化Lcd
 * 参数介绍 : 无
 * 返回值   : 无
 ******************************************************************************/
void initLcd()
{
	LcdWriteCmd(0x38);  //16*2显示,5*7点阵,8数据接口
	LcdWriteCmd(0x0C);  //显示器开,光标关闭
	LcdWriteCmd(0x06);  //文字不动,地址自动加一
	LcdWriteCmd(0x01);  //清屏
}

/*******************************************************************************
 * 函数名称 : LcdFullClear
 * 函数介绍 : 清空Lcd显示屏
 * 参数介绍 : 无
 * 返回值   : 无
 ******************************************************************************/
void LcdFullClear()
{
	LcdWriteCmd(0x01);
}

/*******************************************************************************
 * 函数名称 : LcdAreaClear
 * 函数介绍 : 清空制定区域的显示屏
 * 参数介绍 : 无
 * 返回值   : 无
 ******************************************************************************/
void LcdAreaClear(unsigned char x, unsigned char y, unsigned char len)
{
	LcdSetCursor(x,y); //将光标移动到制定位置
	while(len--)
	{
		LcdWriteData(' ');
	}
}

/*******************************************************************************
 * 函数名称 : LcdShowString
 * 函数介绍 : 显示字符串
 * 参数介绍 : x,y: 字符串显示的位置
 * 			str : 将要显示的字符串,以'\0'结尾
 * 返回值   : 无
 ******************************************************************************/
void LcdShowString(unsigned char x, unsigned char y,unsigned char *str)
{
	LcdSetCursor(x,y); //设置起始地址
	while(*str != '\0')  //连续写入数据,直到检测到结束符
	{
		LcdWriteData(*str++);  //先发送数据,然后str+1
	}
}
