/*******************************************************************************
 * 文件名称：LED.c
 * 作者    ：  郑朋桥
 * 文件介绍：用于为上层提供统一的LED控制函数.
 * 时间    : 2016/09/09
 ******************************************************************************/
#include "LED.h"
/*******************************************************************************
 * 函数名称 : ledInit
 * 函数介绍 : 初始化小灯,将引脚设置为控制小灯
 * 参数介绍 : 无
 * 返回值  :  无
 ******************************************************************************/
unsigned char ledstatus = 0xFF;
/*******************************************************************************
 * 函数名称 : setLedOn
 * 函数介绍 : 点亮指定小灯
 * 参数介绍 : num  :  要点亮小灯的编号
 * 返回值  :  无
 ******************************************************************************/
void setLedOn(unsigned char num)
{
	ledstatus &= ~(1 << num);
}
 
 /*******************************************************************************
 * 函数名称 : setLedOff
 * 函数介绍 : 熄灭指定小灯
 * 参数介绍 : num  :  要熄灭小灯的编号
 * 返回值  :  无
 ******************************************************************************/
void setLedOff(unsigned char num)
{
    ledstatus |= (1 << num);
}
 
 /*******************************************************************************
 * 函数名称 : setAllLedOn
 * 函数介绍 : 点亮多有小灯
 * 参数介绍 : 无
 * 返回值  :  无
 ******************************************************************************/
void setAllLedOn()
{
    ledstatus = 0x00;  //初始化小灯全为灭
}
 
 /*******************************************************************************
 * 函数名称 : setAllLedOff
 * 函数介绍 : 熄灭所有小灯
 * 参数介绍 : 无
 * 返回值  :  无
 ******************************************************************************/
void setAllLedOff()
{
    ledstatus = 0xFF;  
}
 /*******************************************************************************
 * 函数名称 : setAllLedToggle
 * 函数介绍 : 反转所有小灯
 * 参数介绍 : 无
 * 返回值  :  无
 ******************************************************************************/
void setAllLedToggle()
{
	ledstatus = ~ledstatus;
}
 
 /*******************************************************************************
 * 函数名称 : setLedToggle
 * 函数介绍 : 反转指定LED灯
 * 参数介绍 : num : 要反转的LED编号0~7
 * 返回值  :  无
 ******************************************************************************/
void setLedToggle(unsigned char num)
{
	if( (ledstatus & (1 << num)) )
	{
		ledstatus &= ~(1 << num);
	}
	else
	{
		ledstatus |= (1 << num);
	}
}
 /*******************************************************************************
 * 函数名称 : updateLed
 * 函数介绍 : 更新小灯状态
 * 参数介绍 : 无
 * 返回值  :  无
 ******************************************************************************/
void updateLed()
{
	LEDDATA = 0xFF;
	//初始化led引脚
    ENLED = 1;   //禁止U3/U4
    ADDR3 = 1;   //使能U3
    ADDR2 = 1;   //
    ADDR1 = 1;   //使能引脚LEDS6，使其输出高电平,也就是连接LED灯的引脚。
    ADDR0 = 0;   //
    ENLED = 0;   //使能U3/U4
	LEDDATA = ledstatus;
			
}
