/*******************************************************************************
 * 文件名称：LEDSHU.h
 * 作者    ：  郑朋桥
 * 文件介绍： 数码管相关函数定义,提供数码管的基础操作,函数实现在LEDSHU.c
 * 
 ******************************************************************************/
#ifndef __LEDSHU_H_
#define __LEDSHU_H_

#include "kingst.h"
/*******************************************************************************
 * 函数名称 : updateLedShu
 * 函数介绍 : 刷新数码管的显示,动态刷新
 * 参数介绍 : 无
 * 返回值  :  无
 ******************************************************************************/
extern void updateLedShu(unsigned char data[]);
#endif
