#ifndef __HC05_H_
#define __HC05_H_ 
#include <8052.h>
#include "kingst.h"
#include "config.h"
/*******************************************************************************
 * 函数名称 : HC05Init
 * 函数介绍 : 蓝牙模块初始化,判断蓝牙模块是否存在,
 * 参数介绍 : 无
 * 返回值   : 无
 ******************************************************************************/
extern unsigned char HC05Init();

/*******************************************************************************
 * 函数名称 : HC05ExecCmd
 * 函数介绍 : 执行蓝牙模块的AT指令,不过要按下按键
 * 参数介绍 : cmdStr : 命令字符串
 * 			cmdLen : 命令字符串大小
 *  		 retStr : 用来存储返回的字符串数据的缓冲区
 * 			retStrLen : 缓冲区的大小
 * 返回值   : 真正返回的字符串长度
 ******************************************************************************/
extern unsigned char HC05ExecCmd(char cmdStr[],int cmdLen,\
								char retStr [],int retStrLen);
								
/*******************************************************************************
 * 函数名称 : HC05GetRole
 * 函数介绍 : 得到蓝牙模块的状态
 * 参数介绍 : retStr : 用来存储返回的字符串数据的缓冲区
 * 			retStrLen : 缓冲区的大小
 * 返回值   : 真正返回的字符串长度
 ******************************************************************************/
extern unsigned char HC05GetRole(char retStr [],int retStrLen);

/*******************************************************************************
 * 函数名称 : HC05GetString
 * 函数介绍 : 从蓝牙模块读取数据
 * 参数介绍 : str : 用来存储数据的缓冲区
 * 			strlen : 缓冲区的大小
* 返回值   : 真正返回的字符串长度
 ******************************************************************************/
extern unsigned char HC05GetString(char str [],int strLen);
#endif  
