#include "MOTOR.h"

unsigned char step[8] = {0xE,0xC,0xD,0x9,0xB,0x3,0x7,0x6};
unsigned char st  = 1;

/*******************************************************************************
 * 函数名称 : motorStep
 * 函数介绍 :	 运行步进电机
 * 参数介绍 : 无
 * 返回值   : 无
 ******************************************************************************/
void motorStep()
{
	static char index = 0;
	MOTORDATA( step[index] );
	if(st == 1)
	{
		index++;
		if(index > 7)
		{
			index = 0;
		}
	}
	else
	{
		index--;
		if(index < 0)
		{
			index = 7;
		}
	}
}


/*******************************************************************************
 * 函数名称 : setMotorRunDir
 * 函数介绍 :	  设置步进电机的方向,当dir是1时,为顺时针,不为1时,为逆时针
 * 参数介绍 :  dir : 方式
 * 返回值   : 无
 ******************************************************************************/
void setMotorRunDir(unsigned char dir)
{
	st = dir;
}


/*******************************************************************************
 * 函数名称 : motorRunAngle
 * 函数介绍 :	 按设定方向转动制定角度,步进电机运行4096次,外界转动一圈
 * 参数介绍 :  angle : 将要转动的角度
 * 返回值   : 返回相应的角度对应要转动的次数
 ******************************************************************************/
unsigned int motorRunAngle(float angle)
{
	return (int)(angle/360*4096);
}

