#ifndef __UART_H_
#define __UART_H_
#include "kingst.h"
#include "config.h"

/*******************************************************************************
 * 函数名称 : InterruptUART
 * 函数介绍 : 串口处理程序
 * 参数介绍 : 无
 * 返回值  :  无
 ******************************************************************************/
extern void InterruptUART() __interrupt 4;

/*******************************************************************************
 * 函数名称 : sendNewLine
 * 函数介绍 : 发送换行符
 * 参数介绍 : 无
 * 返回值  :  无
 ******************************************************************************/
extern void sendNewLine();

/*******************************************************************************
 * 函数名称 : initUart
 * 函数介绍 : 初始化串口
 * 参数介绍 : baud  :  设置的波特率
 * 返回值  :  无
 ******************************************************************************/
extern void initUart(unsigned int baud);

/*******************************************************************************
 * 函数名称 : sendChar
 * 函数介绍 : 发送的字符
 * 参数介绍 : ch  :  要发送的字符
 * 返回值  :  无
 ******************************************************************************/
extern void sendChar(char ch);
/*******************************************************************************
 * 函数名称 : sendString
 * 函数介绍 : 要发送的字符串
 * 参数介绍 : str  :  要发送的字符串
 *           len  :  要发送的个数
 * 返回值  :  无
 ******************************************************************************/
extern void sendString(char * str, int len);

/*******************************************************************************
 * 函数名称 : readChar
 * 函数介绍 : 读取字符
 * 参数介绍 : ch  :  读取的字符存放位置
 * 返回值  :  无
 ******************************************************************************/
extern char readChar();


/*******************************************************************************
 * 函数名称 : readString
 * 函数介绍 : 读取字符串
 * 参数介绍 : str  :  读取字符串暂存的位置
 * 			len  :   要读取的位数
 * 返回值  :  正真读取的位数
 ******************************************************************************/
extern int readString(char * str, int len);


/*******************************************************************************
 * 函数名称 : readStringWait
 * 函数介绍 : 阻塞读取字符串
 * 参数介绍 : str  :  读取字符串暂存的位置
 * 			len  :   将会读取的位数
 * 返回值  :  无
 ******************************************************************************/
extern void readStringWait(char * str, int len);


/*******************************************************************************
 * 函数名称 : setUartRXFun
 * 函数介绍 : 设置接收中断时,调用的函数,可以做一些相关的事情,比如记录流量,但是时间应尽量短
 * 参数介绍 :  inUART0_RXISR_function :   将要设置的函数
 * 返回值  :  无
 ******************************************************************************/
extern void setUartRXFun( void (*inUART0_RXISR_function)());

/*******************************************************************************
 * 函数名称 : setUartTXFun
 * 函数介绍 : 设置发送中断时,调用的函数,可以做一些相关的事情,比如记录流量,但是时间应尽量短
 * 参数介绍 : inUART0_TXISR_function  :  将要设置的函数
 * 			len  :   将会读取的位数
 * 返回值  :  无
 ******************************************************************************/
extern void setUartTXFun( void (*inUART0_TXISR_function)());

#endif
